{
    "AppPush": [
        // App notification MsgId starts from -1000000 to -4
        {
            "MsgId": 0,
            "IsDisposable": false,
            "Severity": "Success",
            "Title": "Welcome to Collapse Launcher",
            "Message": "Now you can install or migrate your existing game here. For more information/guides, please visit: https://github.com/neon-nyan/CollapseLauncher/Wiki"
        },
        {
            "MsgId": -4,
            "IsDisposable": false,
            "Severity": "Error",
            "Title": "Announcement Regarding to Hi3Mirror Services Suspension",
            "Message": "We are really sorry that Hi3Mirror Services is temporarily stopped and suspend all its services (including Game Private Mirror, Caches API, Game Repair API, and Game Version Conversion API) and make some functionalities on Collapse Launcher unusable. Once again, we are apologize regarding to this inconvenience. We are trying to bring this service up as soon as possible and hope we can bring this service up before June 22nd 2022. Thank you for your understanding and support.\n\nSincerely,\n@neon-nyan"
        },
    ],
    "RegionPush": [
        // Region Push notification MsgId for Hi3SEA starts from 1 to 999999 : 2 Used
        // Region Push notification MsgId for Hi3Global starts from 1000000 to 1999999 : 1000002 Used
        // Region Push notification MsgId for Hi3CN starts from 2000000 to 2999999 : 2000001 Used
        // Region Push notification MsgId for Hi3TW starts from 3000000 to 3999999
        // Region Push notification MsgId for Hi3KR starts from 4000000 to 4999999
        // Region Push notification MsgId for GIGlb starts from 5000000 to 5999999 : 5000000 Used
        // Region Push notification MsgId for GICN starts from 6000000 to 6999999 : 6000000 Used
        {
            "MsgId": 2000001,
            "IsDisposable": true,
            "RegionProfile": "Hi3CN",
            "Severity": "Success",
            "Title": "Game Repair for Mainland China Region is Back to Online!",
            "Message": "Game Repair functionality for Mainland China region is now back to online! Thank you for your patience and now you can try this feature back again."
        },
    ]
}
